tutorials/Ramp/steady/predict/trained/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
    inlet
    {
        type              fixedValue;
        value             $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    "(sym.*|top)"
    {
        type            symmetry;
    }
    bot
    {
        type            fixedValue;
        value           uniform 1e-14;
    }
}



// ************************************************************************* //
